---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.#ctor
source: html/aa3c48a1-94c7-a3dd-1b20-faa87fe1a23e.htm
---
# Autodesk.Revit.DB.ScheduleFilter.#ctor Method

Creates a new ScheduleFilter.

## Syntax (C#)
```csharp
public ScheduleFilter()
```